MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM100/mcu.h
#define _USBCSR3_NAK_POSITION                    0x00000018
#define _USBCSR3_NAK_MASK                        0x01000000
#define _USBCSR3_NAK_LENGTH                      0x00000001

#define _USBCSR3_TESTJ_POSITION                  0x00000019
#define _USBCSR3_TESTJ_MASK                      0x02000000
#define _USBCSR3_TESTJ_LENGTH                    0x00000001

#define _USBCSR3_TESTK_POSITION                  0x0000001A
#define _USBCSR3_TESTK_MASK                      0x04000000
#define _USBCSR3_TESTK_LENGTH                    0x00000001

#define _USBCSR3_PACKET_POSITION                 0x0000001B
#define _USBCSR3_PACKET_MASK                     0x08000000
#define _USBCSR3_PACKET_LENGTH                   0x00000001

#define _USBCSR3_FORCEHS_POSITION                0x0000001C
#define _USBCSR3_FORCEHS_MASK                    0x10000000
#define _USBCSR3_FORCEHS_LENGTH                  0x00000001

#define _USBCSR3_FORCEFS_POSITION                0x0000001D
#define _USBCSR3_FORCEFS_MASK                    0x20000000
#define _USBCSR3_FORCEFS_LENGTH                  0x00000001

#define _USBCSR3_FIFOACC_POSITION                0x0000001E
#define _USBCSR3_FIFOACC_MASK                    0x40000000
#define _USBCSR3_FIFOACC_LENGTH                  0x00000001

#define _USBCSR3_FORCEHST_POSITION               0x0000001F
#define _USBCSR3_FORCEHST_MASK                   0x80000000
#define _USBCSR3_FORCEHST_LENGTH                 0x00000001

#define _USBIENCSR1_RXMAXP_POSITION              0x00000000
#define _USBIENCSR1_RXMAXP_MASK                  0x000007FF
#define _USBIENCSR1_RXMAXP_LENGTH                0x0000000B

#define _USBIENCSR1_MULT_POSITION                0x0000000B
#define _USBIENCSR1_MULT_MASK                    0x0000F800
#define _USBIENCSR1_MULT_LENGTH                  0x00000005

#define _USBIENCSR1_RXPKTRDY_POSITION            0x00000010
#define _USBIENCSR1_RXPKTRDY_MASK                0x00010000
#define _USBIENCSR1_RXPKTRDY_LENGTH              0x00000001

#define _USBIENCSR1_FIFOFULL_POSITION            0x00000011
#define _USBIENCSR1_FIFOFULL_MASK                0x00020000
#define _USBIENCSR1_FIFOFULL_LENGTH              0x00000001

#define _USBIENCSR1_ERROR_POSITION               0x00000012
#define _USBIENCSR1_ERROR_MASK                   0x00040000
#define _USBIENCSR1_ERROR_LENGTH                 0x00000001

#define _USBIENCSR1_DERRNAKT_POSITION            0x00000013
#define _USBIENCSR1_DERRNAKT_MASK                0x00080000
#define _USBIENCSR1_DERRNAKT_LENGTH              0x00000001

#define _USBIENCSR1_FLUSH_POSITION               0x00000014
#define _USBIENCSR1_FLUSH_MASK                   0x00100000
#define _USBIENCSR1_FLUSH_LENGTH                 0x00000001

#define _USBIENCSR1_REQPKT_POSITION              0x00000015
#define _USBIENCSR1_REQPKT_MASK                  0x00200000
#define _USBIENCSR1_REQPKT_LENGTH                0x00000001

#define _USBIENCSR1_RXSTALL_POSITION             0x00000016
#define _USBIENCSR1_RXSTALL_MASK                 0x00400000
#define _USBIENCSR1_RXSTALL_LENGTH               0x00000001

#define _USBIENCSR1_CLRDT_POSITION               0x00000017
#define _USBIENCSR1_CLRDT_MASK                   0x00800000
#define _USBIENCSR1_CLRDT_LENGTH                 0x00000001

#define _USBIENCSR1_INCOMPRX_POSITION            0x00000018
#define _USBIENCSR1_INCOMPRX_MASK                0x01000000
#define _USBIENCSR1_INCOMPRX_LENGTH              0x00000001

#define _USBIENCSR1_DATATGGL_POSITION            0x00000019
#define _USBIENCSR1_DATATGGL_MASK                0x02000000
#define _USBIENCSR1_DATATGGL_LENGTH              0x00000001

#define _USBIENCSR1_DATATWEN_POSITION            0x0000001A
#define _USBIENCSR1_DATATWEN_MASK                0x04000000
#define _USBIENCSR1_DATATWEN_LENGTH              0x00000001

#define _USBIENCSR1_DMAREQMD_POSITION            0x0000001B
#define _USBIENCSR1_DMAREQMD_MASK                0x08000000
#define _USBIENCSR1_DMAREQMD_LENGTH              0x00000001

#define _USBIENCSR1_PIDERR_POSITION              0x0000001C
#define _USBIENCSR1_PIDERR_MASK                  0x10000000
#define _USBIENCSR1_PIDERR_LENGTH                0x00000001

#define _USBIENCSR1_DMAREQEN_POSITION            0x0000001D
#define _USBIENCSR1_DMAREQEN_MASK                0x20000000
#define _USBIENCSR1_DMAREQEN_LENGTH              0x00000001

#define _USBIENCSR1_AUTORQ_POSITION              0x0000001E
#define _USBIENCSR1_AUTORQ_MASK                  0x40000000
#define _USBIENCSR1_AUTORQ_LENGTH                0x00000001

#define _USBIENCSR1_AUTOCLR_POSITION             0x0000001F
#define _USBIENCSR1_AUTOCLR_MASK                 0x80000000
#define _USBIENCSR1_AUTOCLR_LENGTH               0x00000001

#define _USBIENCSR1_OVERRUN_POSITION             0x00000012
#define _USBIENCSR1_OVERRUN_MASK                 0x00040000
#define _USBIENCSR1_OVERRUN_LENGTH               0x00000001

#define _USBIENCSR1_DATAERR_POSITION             0x00000013
#define _USBIENCSR1_DATAERR_MASK                 0x00080000
#define _USBIENCSR1_DATAERR_LENGTH               0x00000001

#define _USBIENCSR1_SENDSTALL_POSITION           0x00000015
#define _USBIENCSR1_SENDSTALL_MASK               0x00200000
#define _USBIENCSR1_SENDSTALL_LENGTH             0x00000001

#define _USBIENCSR1_SENTSTALL_POSITION           0x00000016
#define _USBIENCSR1_SENTSTALL_MASK               0x00400000
#define _USBIENCSR1_SENTSTALL_LENGTH             0x00000001

#define _USBIENCSR1_DISNYET_POSITION             0x0000001C
#define _USBIENCSR1_DISNYET_MASK                 0x10000000
#define _USBIENCSR1_DISNYET_LENGTH               0x00000001

#define _USBIENCSR1_ISO_POSITION                 0x0000001E
#define _USBIENCSR1_ISO_MASK                     0x40000000
#define _USBIENCSR1_ISO_LENGTH                   0x00000001

#define _USBFIFO0_DATA_POSITION                  0x00000000
#define _USBFIFO0_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO0_DATA_LENGTH                    0x00000020

#define _USBFIFO1_DATA_POSITION                  0x00000000
#define _USBFIFO1_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO1_DATA_LENGTH                    0x00000020

#define _USBFIFO2_DATA_POSITION                  0x00000000
#define _USBFIFO2_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO2_DATA_LENGTH                    0x00000020

#define _USBFIFO3_DATA_POSITION                  0x00000000
#define _USBFIFO3_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO3_DATA_LENGTH                    0x00000020

#define _USBFIFO4_DATA_POSITION                  0x00000000
#define _USBFIFO4_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO4_DATA_LENGTH                    0x00000020

#define _USBFIFO5_DATA_POSITION                  0x00000000
#define _USBFIFO5_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO5_DATA_LENGTH                    0x00000020

#define _USBFIFO6_DATA_POSITION                  0x00000000
#define _USBFIFO6_DATA_MASK                      0xFFFFFFFF
#define _USBFIFO6_DATA_LENGTH                    0x00000020

