MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM100/mcu.h
#define _UBADEVCFG0_TRCEN_POSITION               0x00000005
#define _UBADEVCFG0_TRCEN_MASK                   0x00000020
#define _UBADEVCFG0_TRCEN_LENGTH                 0x00000001

#define _UBADEVCFG0_BOOTISA_POSITION             0x00000006
#define _UBADEVCFG0_BOOTISA_MASK                 0x00000040
#define _UBADEVCFG0_BOOTISA_LENGTH               0x00000001

#define _UBADEVCFG0_FECCCON_POSITION             0x00000008
#define _UBADEVCFG0_FECCCON_MASK                 0x00000300
#define _UBADEVCFG0_FECCCON_LENGTH               0x00000002

#define _UBADEVCFG0_FSLEEP_POSITION              0x0000000A
#define _UBADEVCFG0_FSLEEP_MASK                  0x00000400
#define _UBADEVCFG0_FSLEEP_LENGTH                0x00000001

#define _UBADEVCFG0_DBGPER_POSITION              0x0000000C
#define _UBADEVCFG0_DBGPER_MASK                  0x00007000
#define _UBADEVCFG0_DBGPER_LENGTH                0x00000003

#define _UBADEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _UBADEVCFG0_EJTAGBEN_MASK                0x40000000
#define _UBADEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _UBADEVCFG0_FDEBUG_POSITION              0x00000000
#define _UBADEVCFG0_FDEBUG_MASK                  0x00000003
#define _UBADEVCFG0_FDEBUG_LENGTH                0x00000002

#define _UBADEVCFG0_w_POSITION                   0x00000000
#define _UBADEVCFG0_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG0_w_LENGTH                     0x00000020

#define _UBADEVCP0_CP_POSITION                   0x0000001C
#define _UBADEVCP0_CP_MASK                       0x10000000
#define _UBADEVCP0_CP_LENGTH                     0x00000001

#define _UBADEVCP0_w_POSITION                    0x00000000
#define _UBADEVCP0_w_MASK                        0xFFFFFFFF
#define _UBADEVCP0_w_LENGTH                      0x00000020

#define _UBASEQ0_TSEQ_POSITION                   0x00000000
#define _UBASEQ0_TSEQ_MASK                       0x0000FFFF
#define _UBASEQ0_TSEQ_LENGTH                     0x00000010

#define _UBASEQ0_CSEQ_POSITION                   0x00000010
#define _UBASEQ0_CSEQ_MASK                       0xFFFF0000
#define _UBASEQ0_CSEQ_LENGTH                     0x00000010

#define _UBASEQ0_w_POSITION                      0x00000000
#define _UBASEQ0_w_MASK                          0xFFFFFFFF
#define _UBASEQ0_w_LENGTH                        0x00000020

#define _ABF1DEVCFG3_USERID_POSITION             0x00000000
#define _ABF1DEVCFG3_USERID_MASK                 0x0000FFFF
#define _ABF1DEVCFG3_USERID_LENGTH               0x00000010

#define _ABF1DEVCFG3_FMIIEN_POSITION             0x00000018
#define _ABF1DEVCFG3_FMIIEN_MASK                 0x01000000
#define _ABF1DEVCFG3_FMIIEN_LENGTH               0x00000001

#define _ABF1DEVCFG3_FETHIO_POSITION             0x00000019
#define _ABF1DEVCFG3_FETHIO_MASK                 0x02000000
#define _ABF1DEVCFG3_FETHIO_LENGTH               0x00000001

#define _ABF1DEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _ABF1DEVCFG3_PGL1WAY_MASK                0x08000000
#define _ABF1DEVCFG3_PGL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_PMDL1WAY_POSITION           0x0000001C
#define _ABF1DEVCFG3_PMDL1WAY_MASK               0x10000000
#define _ABF1DEVCFG3_PMDL1WAY_LENGTH             0x00000001

#define _ABF1DEVCFG3_IOL1WAY_POSITION            0x0000001D
#define _ABF1DEVCFG3_IOL1WAY_MASK                0x20000000
#define _ABF1DEVCFG3_IOL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_FUSBIDIO_POSITION           0x0000001E
#define _ABF1DEVCFG3_FUSBIDIO_MASK               0x40000000
#define _ABF1DEVCFG3_FUSBIDIO_LENGTH             0x00000001

#define _ABF1DEVCFG3_w_POSITION                  0x00000000
#define _ABF1DEVCFG3_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG3_w_LENGTH                    0x00000020

#define _ABF1DEVCFG2_FPLLIDIV_POSITION           0x00000000
#define _ABF1DEVCFG2_FPLLIDIV_MASK               0x00000007
#define _ABF1DEVCFG2_FPLLIDIV_LENGTH             0x00000003

#define _ABF1DEVCFG2_FPLLRNG_POSITION            0x00000004
#define _ABF1DEVCFG2_FPLLRNG_MASK                0x00000070
#define _ABF1DEVCFG2_FPLLRNG_LENGTH              0x00000003

#define _ABF1DEVCFG2_FPLLICLK_POSITION           0x00000007
#define _ABF1DEVCFG2_FPLLICLK_MASK               0x00000080
#define _ABF1DEVCFG2_FPLLICLK_LENGTH             0x00000001

#define _ABF1DEVCFG2_FPLLMULT_POSITION           0x00000008
#define _ABF1DEVCFG2_FPLLMULT_MASK               0x00007F00
#define _ABF1DEVCFG2_FPLLMULT_LENGTH             0x00000007

#define _ABF1DEVCFG2_FPLLODIV_POSITION           0x00000010
#define _ABF1DEVCFG2_FPLLODIV_MASK               0x00070000
#define _ABF1DEVCFG2_FPLLODIV_LENGTH             0x00000003

#define _ABF1DEVCFG2_UPLLFSEL_POSITION           0x0000001E
#define _ABF1DEVCFG2_UPLLFSEL_MASK               0x40000000
#define _ABF1DEVCFG2_UPLLFSEL_LENGTH             0x00000001

#define _ABF1DEVCFG2_UPLLEN_POSITION             0x0000001F
#define _ABF1DEVCFG2_UPLLEN_MASK                 0x80000000
#define _ABF1DEVCFG2_UPLLEN_LENGTH               0x00000001

#define _ABF1DEVCFG2_w_POSITION                  0x00000000
#define _ABF1DEVCFG2_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG2_w_LENGTH                    0x00000020

#define _ABF1DEVCFG1_FNOSC_POSITION              0x00000000
#define _ABF1DEVCFG1_FNOSC_MASK                  0x00000007
#define _ABF1DEVCFG1_FNOSC_LENGTH                0x00000003

#define _ABF1DEVCFG1_DMTINTV_POSITION            0x00000003
#define _ABF1DEVCFG1_DMTINTV_MASK                0x00000038
#define _ABF1DEVCFG1_DMTINTV_LENGTH              0x00000003

#define _ABF1DEVCFG1_FSOSCEN_POSITION            0x00000006
#define _ABF1DEVCFG1_FSOSCEN_MASK                0x00000040
#define _ABF1DEVCFG1_FSOSCEN_LENGTH              0x00000001

#define _ABF1DEVCFG1_IESO_POSITION               0x00000007
#define _ABF1DEVCFG1_IESO_MASK                   0x00000080
#define _ABF1DEVCFG1_IESO_LENGTH                 0x00000001

#define _ABF1DEVCFG1_POSCMOD_POSITION            0x00000008
#define _ABF1DEVCFG1_POSCMOD_MASK                0x00000300
#define _ABF1DEVCFG1_POSCMOD_LENGTH              0x00000002

#define _ABF1DEVCFG1_OSCIOFNC_POSITION           0x0000000A
#define _ABF1DEVCFG1_OSCIOFNC_MASK               0x00000400
#define _ABF1DEVCFG1_OSCIOFNC_LENGTH             0x00000001

#define _ABF1DEVCFG1_FCKSM_POSITION              0x0000000E
#define _ABF1DEVCFG1_FCKSM_MASK                  0x0000C000
#define _ABF1DEVCFG1_FCKSM_LENGTH                0x00000002

